{
  "basics": {
    "name": "Sebastián Fernández Rivera",
    "image": "assets/img/prof_pic_1.jpg",
    "email": "sebastian.fernandezrivera24@gmail.com",
    "phone": "+(506) 8730-3185",
    "url": "https://sebasfr.github.io/",
    "summary": "Advanced undergraduate student and research assistant at LSE.",
    "location": {
      "city": "San Jose",
      "countryCode": "CR"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "sebasfr",
        "url": "https://www.linkedin.com/in/sebasfr/"
      }
    ]
  },
    "education": [
    {
      "institution": "University of Costa Rica",
      "location": "San José, CR",
      "area": "Enrolled in B.A. in Mathematics. ",
      "studyType": "B.A. in Economics.",
      "startDate": "2022",
      "endDate": "2026",
      "score": "9.6/10"
    }
  ],
  "work": [
    {
      "name": "Responsible Sourcing? Evidence from Costa Rica",
      "position": "Research Assistant",
      "startDate": "Apr. 2025",
      "endDate": "Pres.",
      "highlights": ["Under supervision of Jose P. Vasquez (LSE) and Isabela Manelici (LSE)"],
      "summary": "R&R at the American Economic Review. Contribution mainly on ChatGPT–based text‐analysis, which systematically extracts qualitative and quantitative information from a sample of responsible-sourcing policy documents. Development of a comprehensive replication package encompassing all Stata and Python code used in the paper, fully compliant with the AER’s standards for replication packages."
    },
    {
      "name": "Doble Check",
      "position": "Production Assistant",
      "startDate": "Sep. 2024",
      "endDate": "Pres.",
      "summary": "Doble Check is a public discourse verification initiative funded by the University of Costa Rica (UCR). Provided economic guidance for the development and publication of fact-checking articles, encompassing public data collection, literature review, and descriptive statistical analysis to assess the accuracy of claims made in public discourse."
    },
    {
      "name": "Do Central Banks Follow the Fed?",
      "position": "Research Assistant",
      "startDate": "Aug. 2024",
      "endDate": "Mar. 2025",
      "highlights": ["Under supervision of Alfredo Mendoza-Fernández (Ph.D. Candidate, UC Berkeley)"],
      "summary": "Assisted in the construction of a novel dataset leveraging meeting-frequency data on monetary policy rate decisions for 50+ emerging economies, displaying empirical relationships hitherto unobservable in monthly or quarterly frequency data. This new data will contribute in the development of precise monetary policy shock measures for emerging markets."
    },
      {
      "name": "EC2200 - Microeconomic Theory 2 (University of Costa Rica)",
      "position": "Teaching Assistant",
      "startDate": "Apr. 2024",
      "endDate": "Jul. 2025",
      "highlights": ["Under supervision of Edgar Robles Cordero (UCR)."],
      "summary": "Lecturing on optimization, consumer theory, welfare, producer theory, and general equilibrium models. Design and implementation of practice sets and quizzes."
    },
    {
      "name": "Dollarization, Macroeconomic Experiences and Monetary Policy",
      "position": "Research Assistant",
      "startDate": "Jan. 2024",
      "endDate": "",
      "highlights": ["Under supervision of Jonathan Garita (Central Bank of Costa Rica and UCR) and Alfredo Mendoza-Fernández (Ph.D. Candidate, UC Berkeley)."],
      "summary": "Development of an automated web-scraping script for civil-registry queries, complemented by literature review and synthesis and statistical programming in R."
    }
  ],
    "projects": [
    {
      "name": "Inflationary Convergence in Costa Rica: An Empirical Evaluation of the Inflation",
      "summary": "Co-authored with Alberth Vargas Miranda (UCR). We implement a state-of-the-art state-space model that fuses realized inflation and long-run inflation expectations to recover the underlying inflationary trend in Costa Rica in order to evaluate the Central Bank's compliance with the target value of 3%. Our estimates reveal a trend that has been consistently below the target, suggesting the presence of an excessively contractionary monetary stance.",
      "startDate": "2025",
      "endDate": "",
      "url": "https://example.com"
    },
    {
      "name": "Reserve Requirements and Deposits: Evidence From Financial Microdata",
      "summary": "Co-authored with Jonathan Garita (Central Bank of Costa Rica and UCR). This study seeks to analyze the effects of Costa Rica’s June 2019 reduction and August 2022 reinstatement of domestic-currency reserve requirements on sight and term deposits. We construct a comprehensive anonymized dataset from administrative microdata spanning from 2013 to 2024, which comprises the universe of loan and deposit-level records (of both domestic currency and USD) within the supervised financial system. The next step is to choose an adequate empirical specification to exploit the granularity of the data.",
      "startDate": "2025",
      "endDate": "",
      "url": "https://example.com"
    },
    {
      "name": "Supply Shocks, Monetary Policy and Foreign Investment: The Costa Rican Case",
      "summary": "Awarded Essay at the Latin American Reserve Fund Research Contest. I investigate the implications of global supply disruptions for Latin American economies, with a particular focus on the Costa Rican case. I argue that the interplay between foreign investment attraction strategies, nearshoring, and monetary policy can collectively account for the country’s atypical display of accelerated growth and deflation shortly after a supply shock. For such purposes, I adopt a mixed framework by combining a descriptive analysis of macroeconomic indicators and an endogenous New Keynesian Growth Model to reconcile the apparent disconnect between standard business cycles literature and the empirical findings.",
      "startDate": "2024",
      "endDate": "",
      "url": "https://example.com"
    }
  ],
  "awards": [
    {
      "title": "First Place Award, Latin American Reserve Fund Research Contest ($5000)",
      "date": "2024",
      "awarder": "Latin American Reserve Fund (FLAR)",
      "url": "https://flar.com/iii-concurso-de-ensayos-flar/"
    },
    {
      "title": "Silver Medal",
      "date": "2021",
      "awarder": "Costa Rican Math Olympiad"
    },
      {
      "title": "Bronze Medal",
      "date": "2017, 2020",
      "awarder": "Costa Rican Math Olympiad"
    }
  ],
  "skills": [
    {
      "name": "Programming languages and Software",
      "level": "Proficient",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "R",
        "Stata",
        "Python",
        "Matlab",
        "Dynare"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Proficient (117/120  TOEFL score)",
      "icon": ""
    },
    {
      "language": "Spanish",
      "fluency": "Native",
      "icon": ""
    }
  ],
  "interests": [
    {
      "name": "Economics",
      "icon": "fa-solid fa-tag",
      "keywords": [
        "Monetary Economics",
        "Applied Macroeconomics",
        "International Economics"
      ]
    }
  ]
}
